tests/fixtures/payment_intent/retrieved.json

{
    "id": "pi_xxxxx",
    "resource": "payment_intent",
    "amount": 10000,
    "amount_received": 10000,
    "amount_capturable": 0,
    "client_secret": "pi_xxxxx_secret_xxxxx",
    "currency": "PHP",
    "description": "",
    "last_payment_error": null,
    "latest_payment": {
        "id": "pay_xxxxx",
        "resource": "payment",
        "amount": 10000,
        "status": "paid"
    },
    "livemode": false,
    "metadata": null,
    "next_action": null,
    "payment_method_options": {
        "card": {
            "capture_type": "automatic"
        }
    },
    "payment_methods": ["card", "gcash"],
    "statement_descriptor": null,
    "status": "succeeded",
    "payment_method_id": "pm_xxxxx",
    "return_url": "https://my-application.com/return",
    "capture_before_at": null,
    "customer": null,
    "created_at": 1700407880,
    "updated_at": 1700408000
}
